set sdc_version 1.9


# ****************************************************
# coreConsultant generated intent command file for design: parking
# Generator version: 2.0
# Generated at: 20:44:18 on 11/28/15
# ****************************************************
# Clock waveform definitions and synthesis directives.
create_clock [get_ports {HCLK_hclk}] -name HCLK_hclk -period 6 -waveform {0 3} 
set_clock_uncertainty 0 [get_clocks {HCLK_hclk}] 
set_clock_latency 0 [get_clocks {HCLK_hclk}] 
set_clock_latency -source 0 [get_clocks {HCLK_hclk}]
create_clock [get_ports {PCLK_pclk}] -name PCLK_pclk -period 6 -waveform {0 3} 
set_clock_uncertainty 0 [get_clocks {PCLK_pclk}] 
set_clock_latency 0 [get_clocks {PCLK_pclk}] 
set_clock_latency -source 0 [get_clocks {PCLK_pclk}]
create_clock [get_ports {i_i2c_ic_clk}] -name i_i2c_ic_clk -period 6 -waveform {0 3} 
set_clock_uncertainty 0 [get_clocks {i_i2c_ic_clk}] 
set_clock_latency 0 [get_clocks {i_i2c_ic_clk}] 
set_clock_latency -source 0 [get_clocks {i_i2c_ic_clk}]
# Virtual clock definitions.
# Operating conditions for the design.
set_operating_conditions nom_pvt -library lsi_10k
# Minimum/Maximum delay values (arrival times) for input ports.
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[31]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[31]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[30]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[30]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[29]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[29]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[28]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[28]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[27]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[27]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[26]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[26]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[25]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[25]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[24]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[24]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[23]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[23]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[22]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[22]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[21]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[21]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[20]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[20]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[19]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[19]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[18]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[18]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[17]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[17]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[16]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[16]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[15]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[15]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[14]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[14]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[13]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[13]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[12]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[12]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[11]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[11]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[10]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[10]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[9]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[9]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[8]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[8]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[7]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[7]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[6]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[6]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[5]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[5]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[4]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[4]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[3]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[3]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[2]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[2]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_haddr[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst[2]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst[2]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hburst[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hbusreq}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hbusreq}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hlock}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hlock}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[3]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[3]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[2]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[2]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hprot[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize[2]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize[2]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hsize[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_htrans}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_htrans}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_htrans[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_htrans[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_htrans[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_htrans[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[31]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[31]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[30]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[30]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[29]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[29]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[28]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[28]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[27]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[27]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[26]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[26]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[25]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[25]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[24]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[24]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[23]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[23]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[22]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[22]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[21]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[21]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[20]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[20]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[19]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[19]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[18]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[18]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[17]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[17]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[16]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[16]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[15]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[15]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[14]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[14]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[13]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[13]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[12]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[12]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[11]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[11]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[10]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[10]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[9]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[9]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[8]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[8]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[7]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[7]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[6]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[6]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[5]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[5]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[4]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[4]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[3]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[3]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[2]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[2]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwdata[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwrite}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hwrite}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[31]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[31]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[30]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[30]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[29]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[29]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[28]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[28]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[27]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[27]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[26]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[26]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[25]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[25]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[24]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[24]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[23]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[23]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[22]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[22]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[21]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[21]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[20]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[20]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[19]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[19]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[18]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[18]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[17]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[17]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[16]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[16]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[15]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[15]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[14]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[14]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[13]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[13]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[12]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[12]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[11]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[11]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[10]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[10]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[9]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[9]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[8]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[8]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[7]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[7]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[6]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[6]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[5]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[5]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[4]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[4]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[3]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[3]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[2]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[2]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hrdata[0]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hready_resp}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hready_resp}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hresp}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hresp}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hresp[1]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hresp[1]}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hresp[0]}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hresp[0]}]
set_input_delay -add_delay -max 0 -clock HCLK_hclk [get_ports {HRESETn_hresetn}]
set_input_delay -add_delay -min 0 -clock HCLK_hclk [get_ports {HRESETn_hresetn}]
set_input_delay -add_delay -max 2.4 -clock PCLK_pclk [get_ports {PRESETn_presetn}]
set_input_delay -add_delay -min 2.4 -clock PCLK_pclk [get_ports {PRESETn_presetn}]
set_input_delay -add_delay -max 1.2 -clock HCLK_hclk [get_ports {i_ahb_pause}]
set_input_delay -add_delay -min 1.2 -clock HCLK_hclk [get_ports {i_ahb_pause}]
set_input_delay -add_delay -max 3.96 -clock HCLK_hclk [get_ports {i_apb_pclk_en}]
set_input_delay -add_delay -min 3.96 -clock HCLK_hclk [get_ports {i_apb_pclk_en}]
set_input_delay -add_delay -max 2.4 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_clk_in_a}]
set_input_delay -add_delay -min 2.4 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_clk_in_a}]
set_input_delay -add_delay -max 2.4 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_data_in_a}]
set_input_delay -add_delay -min 2.4 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_data_in_a}]
set_input_delay -add_delay -max 2.4 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_rst_n}]
set_input_delay -add_delay -min 2.4 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_rst_n}]
# Minimum/Maximum delay values (external required times) for output ports.
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hgrant}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hgrant}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[31]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[31]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[30]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[30]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[29]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[29]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[28]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[28]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[27]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[27]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[26]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[26]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[25]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[25]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[24]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[24]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[23]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[23]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[22]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[22]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[21]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[21]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[20]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[20]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[19]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[19]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[18]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[18]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[17]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[17]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[16]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[16]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[15]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[15]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[14]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[14]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[13]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[13]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[12]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[12]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[11]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[11]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[10]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[10]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[9]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[9]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[8]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[8]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[7]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[7]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[6]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[6]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[5]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[5]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[4]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[4]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[3]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[3]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hrdata[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hready}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hready}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hresp}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hresp}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hresp[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hresp[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hresp[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Master_hresp[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[31]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[31]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[30]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[30]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[29]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[29]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[28]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[28]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[27]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[27]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[26]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[26]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[25]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[25]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[24]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[24]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[23]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[23]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[22]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[22]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[21]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[21]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[20]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[20]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[19]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[19]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[18]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[18]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[17]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[17]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[16]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[16]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[15]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[15]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[14]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[14]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[13]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[13]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[12]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[12]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[11]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[11]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[10]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[10]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[9]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[9]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[8]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[8]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[7]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[7]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[6]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[6]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[5]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[5]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[4]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[4]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[3]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[3]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_haddr[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hburst[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hmastlock}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hmastlock}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[3]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[3]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hprot[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hready}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hready}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsel}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsel}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hsize[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_htrans}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_htrans}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_htrans[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_htrans[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_htrans[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_htrans[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[31]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[31]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[30]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[30]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[29]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[29]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[28]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[28]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[27]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[27]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[26]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[26]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[25]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[25]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[24]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[24]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[23]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[23]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[22]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[22]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[21]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[21]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[20]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[20]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[19]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[19]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[18]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[18]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[17]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[17]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[16]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[16]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[15]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[15]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[14]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[14]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[13]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[13]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[12]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[12]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[11]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[11]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[10]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[10]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[9]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[9]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[8]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[8]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[7]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[7]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[6]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[6]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[5]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[5]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[4]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[4]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[3]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[3]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwdata[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwrite}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {ex_i_ahb_AHB_Slave_hwrite}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_ahbarbint}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_ahbarbint}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[3]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[3]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[2]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[2]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[1]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[1]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[0]}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_hmaster_data[0]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[31]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[31]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[30]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[30]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[29]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[29]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[28]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[28]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[27]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[27]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[26]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[26]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[25]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[25]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[24]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[24]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[23]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[23]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[22]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[22]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[21]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[21]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[20]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[20]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[19]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[19]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[18]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[18]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[17]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[17]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[16]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[16]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[15]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[15]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[14]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[14]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[13]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[13]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[12]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[12]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[11]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[11]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[10]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[10]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[9]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[9]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[8]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[8]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[7]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[7]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[6]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[6]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[5]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[5]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[4]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[4]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[3]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[3]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[2]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[2]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[1]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[1]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[0]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hrdata_s0[0]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hready_resp_s0}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hready_resp_s0}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hresp_s0}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hresp_s0}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hresp_s0[1]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hresp_s0[1]}]
set_output_delay -add_delay -max 4.2 -clock HCLK_hclk [get_ports {i_ahb_hresp_s0[0]}]
set_output_delay -add_delay -min 4.2 -clock HCLK_hclk [get_ports {i_ahb_hresp_s0[0]}]
set_output_delay -add_delay -max 1.8 -clock HCLK_hclk [get_ports {i_ahb_hsel_s0}]
set_output_delay -add_delay -min 1.8 -clock HCLK_hclk [get_ports {i_ahb_hsel_s0}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_addr}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_addr}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_addr_10bit}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_addr_10bit}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_data}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_data}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_hs}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_hs}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_master_act}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_master_act}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[4]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[4]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[3]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[3]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[2]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[2]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[1]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[1]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[0]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_mst_cstate[0]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_p_gen}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_p_gen}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_rd}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_rd}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_s_gen}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_s_gen}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slave_act}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slave_act}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[3]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[3]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[2]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[2]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[1]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[1]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[0]}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_slv_cstate[0]}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_wr}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_debug_wr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_activity_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_activity_intr}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_clk_oe}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_clk_oe}]
set_output_delay -add_delay -max 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_data_oe}]
set_output_delay -add_delay -min 1.8 -clock i_i2c_ic_clk [get_ports {i_i2c_ic_data_oe}]
set_output_delay -add_delay -max 3.6 -clock PCLK_pclk [get_ports {i_i2c_ic_en}]
set_output_delay -add_delay -min 3.6 -clock PCLK_pclk [get_ports {i_i2c_ic_en}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_gen_call_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_gen_call_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rd_req_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rd_req_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_done_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_done_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_full_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_full_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_over_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_over_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_under_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_rx_under_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_start_det_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_start_det_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_stop_det_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_stop_det_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_tx_abrt_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_tx_abrt_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_tx_empty_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_tx_empty_intr}]
set_output_delay -add_delay -max 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_tx_over_intr}]
set_output_delay -add_delay -min 1.8 -clock PCLK_pclk [get_ports {i_i2c_ic_tx_over_intr}]
# Estimated loads seen externally by ports.
set_load -pin_load 3 [get_ports {ex_i_ahb_AHB_Master_hgrant}]
set_port_fanout_number 3 [get_ports {ex_i_ahb_AHB_Master_hgrant}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[31]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[31]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[30]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[30]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[29]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[29]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[28]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[28]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[27]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[27]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[26]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[26]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[25]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[25]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[24]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[24]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[23]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[23]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[22]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[22]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[21]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[21]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[20]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[20]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[19]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[19]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[18]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[18]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[17]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[17]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[16]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[16]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[15]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[15]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[14]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[14]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[13]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[13]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[12]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[12]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[11]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[11]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[10]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[10]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[9]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[9]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[8]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[8]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[7]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[7]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[6]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[6]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[5]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[5]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[4]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[4]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[3]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[3]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[2]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[2]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hrdata[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hready}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hready}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hresp}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hresp}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hresp[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hresp[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Master_hresp[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Master_hresp[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[31]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[31]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[30]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[30]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[29]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[29]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[28]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[28]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[27]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[27]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[26]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[26]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[25]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[25]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[24]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[24]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[23]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[23]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[22]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[22]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[21]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[21]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[20]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[20]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[19]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[19]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[18]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[18]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[17]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[17]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[16]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[16]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[15]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[15]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[14]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[14]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[13]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[13]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[12]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[12]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[11]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[11]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[10]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[10]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[9]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[9]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[8]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[8]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[7]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[7]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[6]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[6]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[5]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[5]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[4]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[4]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[3]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[3]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[2]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[2]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_haddr[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hburst}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hburst}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hburst[2]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hburst[2]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hburst[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hburst[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hburst[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hburst[0]}]
set_load -pin_load 3 [get_ports {ex_i_ahb_AHB_Slave_hmastlock}]
set_port_fanout_number 3 [get_ports {ex_i_ahb_AHB_Slave_hmastlock}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hprot}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hprot}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[3]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[3]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[2]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[2]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hprot[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hready}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hready}]
set_load -pin_load 3 [get_ports {ex_i_ahb_AHB_Slave_hsel}]
set_port_fanout_number 3 [get_ports {ex_i_ahb_AHB_Slave_hsel}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hsize}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hsize}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hsize[2]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hsize[2]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hsize[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hsize[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hsize[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hsize[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_htrans}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_htrans}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_htrans[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_htrans[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_htrans[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_htrans[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[31]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[31]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[30]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[30]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[29]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[29]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[28]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[28]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[27]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[27]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[26]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[26]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[25]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[25]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[24]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[24]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[23]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[23]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[22]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[22]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[21]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[21]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[20]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[20]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[19]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[19]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[18]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[18]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[17]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[17]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[16]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[16]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[15]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[15]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[14]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[14]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[13]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[13]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[12]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[12]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[11]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[11]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[10]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[10]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[9]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[9]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[8]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[8]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[7]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[7]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[6]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[6]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[5]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[5]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[4]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[4]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[3]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[3]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[2]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[2]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[1]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[1]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[0]}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwdata[0]}]
set_load -pin_load 6 [get_ports {ex_i_ahb_AHB_Slave_hwrite}]
set_port_fanout_number 6 [get_ports {ex_i_ahb_AHB_Slave_hwrite}]
set_load -pin_load 3 [get_ports {i_ahb_ahbarbint}]
set_port_fanout_number 3 [get_ports {i_ahb_ahbarbint}]
set_load -pin_load 3 [get_ports {i_ahb_hmaster_data}]
set_port_fanout_number 3 [get_ports {i_ahb_hmaster_data}]
set_load -pin_load 3 [get_ports {i_ahb_hmaster_data[3]}]
set_port_fanout_number 3 [get_ports {i_ahb_hmaster_data[3]}]
set_load -pin_load 3 [get_ports {i_ahb_hmaster_data[2]}]
set_port_fanout_number 3 [get_ports {i_ahb_hmaster_data[2]}]
set_load -pin_load 3 [get_ports {i_ahb_hmaster_data[1]}]
set_port_fanout_number 3 [get_ports {i_ahb_hmaster_data[1]}]
set_load -pin_load 3 [get_ports {i_ahb_hmaster_data[0]}]
set_port_fanout_number 3 [get_ports {i_ahb_hmaster_data[0]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[31]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[31]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[30]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[30]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[29]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[29]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[28]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[28]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[27]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[27]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[26]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[26]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[25]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[25]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[24]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[24]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[23]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[23]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[22]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[22]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[21]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[21]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[20]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[20]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[19]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[19]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[18]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[18]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[17]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[17]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[16]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[16]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[15]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[15]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[14]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[14]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[13]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[13]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[12]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[12]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[11]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[11]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[10]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[10]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[9]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[9]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[8]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[8]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[7]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[7]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[6]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[6]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[5]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[5]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[4]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[4]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[3]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[3]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[2]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[2]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[1]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[1]}]
set_load -pin_load 6 [get_ports {i_ahb_hrdata_s0[0]}]
set_port_fanout_number 6 [get_ports {i_ahb_hrdata_s0[0]}]
set_load -pin_load 6 [get_ports {i_ahb_hready_resp_s0}]
set_port_fanout_number 6 [get_ports {i_ahb_hready_resp_s0}]
set_load -pin_load 6 [get_ports {i_ahb_hresp_s0}]
set_port_fanout_number 6 [get_ports {i_ahb_hresp_s0}]
set_load -pin_load 6 [get_ports {i_ahb_hresp_s0[1]}]
set_port_fanout_number 6 [get_ports {i_ahb_hresp_s0[1]}]
set_load -pin_load 6 [get_ports {i_ahb_hresp_s0[0]}]
set_port_fanout_number 6 [get_ports {i_ahb_hresp_s0[0]}]
set_load -pin_load 3 [get_ports {i_ahb_hsel_s0}]
set_port_fanout_number 3 [get_ports {i_ahb_hsel_s0}]
set_load -pin_load 3 [get_ports {i_i2c_debug_addr}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_addr}]
set_load -pin_load 3 [get_ports {i_i2c_debug_addr_10bit}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_addr_10bit}]
set_load -pin_load 3 [get_ports {i_i2c_debug_data}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_data}]
set_load -pin_load 3 [get_ports {i_i2c_debug_hs}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_hs}]
set_load -pin_load 3 [get_ports {i_i2c_debug_master_act}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_master_act}]
set_load -pin_load 3 [get_ports {i_i2c_debug_mst_cstate}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_mst_cstate}]
set_load -pin_load 3 [get_ports {i_i2c_debug_mst_cstate[4]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_mst_cstate[4]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_mst_cstate[3]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_mst_cstate[3]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_mst_cstate[2]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_mst_cstate[2]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_mst_cstate[1]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_mst_cstate[1]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_mst_cstate[0]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_mst_cstate[0]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_p_gen}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_p_gen}]
set_load -pin_load 3 [get_ports {i_i2c_debug_rd}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_rd}]
set_load -pin_load 3 [get_ports {i_i2c_debug_s_gen}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_s_gen}]
set_load -pin_load 3 [get_ports {i_i2c_debug_slave_act}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_slave_act}]
set_load -pin_load 3 [get_ports {i_i2c_debug_slv_cstate}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_slv_cstate}]
set_load -pin_load 3 [get_ports {i_i2c_debug_slv_cstate[3]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_slv_cstate[3]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_slv_cstate[2]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_slv_cstate[2]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_slv_cstate[1]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_slv_cstate[1]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_slv_cstate[0]}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_slv_cstate[0]}]
set_load -pin_load 3 [get_ports {i_i2c_debug_wr}]
set_port_fanout_number 3 [get_ports {i_i2c_debug_wr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_activity_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_activity_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_clk_oe}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_clk_oe}]
set_load -pin_load 3 [get_ports {i_i2c_ic_data_oe}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_data_oe}]
set_load -pin_load 3 [get_ports {i_i2c_ic_en}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_en}]
set_load -pin_load 3 [get_ports {i_i2c_ic_gen_call_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_gen_call_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_rd_req_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_rd_req_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_rx_done_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_rx_done_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_rx_full_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_rx_full_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_rx_over_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_rx_over_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_rx_under_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_rx_under_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_start_det_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_start_det_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_stop_det_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_stop_det_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_tx_abrt_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_tx_abrt_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_tx_empty_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_tx_empty_intr}]
set_load -pin_load 3 [get_ports {i_i2c_ic_tx_over_intr}]
set_port_fanout_number 3 [get_ports {i_i2c_ic_tx_over_intr}]
# Assume the following drive cells for input ports.
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[31]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[30]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[29]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[28]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[27]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[26]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[25]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[24]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[23]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[22]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[21]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[20]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[19]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[18]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[17]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[16]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[15]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[14]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[13]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[12]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[11]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[10]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[9]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[8]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[7]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[6]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[5]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[4]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[3]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[2]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_haddr[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hburst}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hburst[2]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hburst[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hburst[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hbusreq}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hlock}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hprot}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hprot[3]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hprot[2]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hprot[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hprot[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hsize}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hsize[2]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hsize[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hsize[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_htrans}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_htrans[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_htrans[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[31]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[30]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[29]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[28]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[27]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[26]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[25]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[24]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[23]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[22]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[21]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[20]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[19]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[18]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[17]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[16]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[15]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[14]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[13]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[12]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[11]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[10]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[9]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[8]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[7]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[6]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[5]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[4]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[3]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[2]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwdata[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Master_hwrite}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[31]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[30]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[29]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[28]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[27]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[26]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[25]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[24]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[23]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[22]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[21]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[20]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[19]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[18]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[17]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[16]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[15]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[14]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[13]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[12]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[11]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[10]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[9]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[8]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[7]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[6]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[5]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[4]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[3]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[2]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hrdata[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hready_resp}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hresp}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hresp[1]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {ex_i_ahb_AHB_Slave_hresp[0]}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_drive 0 [get_ports {HRESETn_hresetn}]
set_driving_cell [get_ports {PRESETn_presetn}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {i_ahb_pause}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {i_apb_pclk_en}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {i_i2c_ic_clk_in_a}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {i_i2c_ic_data_in_a}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_driving_cell [get_ports {i_i2c_ic_rst_n}] -library lsi_10k -lib_cell FJK1 -pin Q -no_design_rule
set_false_path -from [get_clocks PCLK_pclk] -to [get_clocks i_i2c_ic_clk]
set_false_path -from [get_clocks i_i2c_ic_clk] -to [get_clocks PCLK_pclk]

